app/Http/Controllers/Auth/LoginController.php

select `id` from `organizations` where `user_id` = 4 limit 1
---
    public function authenticated()
    {
        if (auth()->user()->user_type == 'developer' || auth()->user()->user_type == 'admin' || auth()->user()->user_type == 'directorate') {
            flash(translate("WELCOME TO YOUTH ORG DB"))->success();

            return redirect()->route('admin.dashboard');
        } elseif (auth()->user()->user_type == 'organization') {
            $organization_id = Organization::where('user_id', auth()->user()->id)->value('id');