app/Http/Controllers/Organization/DashboardController.php

select exists(select * from `organizations` where `user_id` = 4) as `exists`
select * from `organizations` where `user_id` = 4 limit 1
select exists(select * from `organization_addresses` where `user_id` = 4) as `exists`
select exists(select * from `organization_members` where `user_id` = 4) as `exists`
select exists(select * from `organization_banks` where `user_id` = 4) as `exists`
select exists(select * from `organization_activities` where `user_id` = 4) as `exists`
select * from `organization_documents` where `user_id` = 4 limit 1
---
    public function index()
    {
        $user_id = Auth::id();
        $check_user_id = Organization::where('user_id', $user_id)->exists();
        $check_details = Organization::where('user_id', $user_id)->exists();
        $org_details = Organization::where('user_id', $user_id)->first();
        $check_address = OrganizationAddress::where('user_id', $user_id)->exists();
        $check_member = OrganizationMember::where('user_id', $user_id)->exists();
        $check_bank = OrganizationBank::where('user_id', $user_id)->exists();
        $check_social = OrganizationActivity::where('user_id', $user_id)->exists();

        $documents = OrganizationDocument::where('user_id', $user_id)->first();