app/Http/Controllers/Organization/OrganizationController.php

select * from `districts`
select * from `upazilas`
select * from `divisions`
select * from `organization_documents` where `user_id` = 4 limit 1
select * from `organization_banks` where `user_id` = 4
select * from `organization_awards` where `user_id` = 4
select * from `organization_addresses` where `user_id` = 4 limit 1
select * from `organizations` where `user_id` = 4 limit 1
select * from `organization_activities` where `user_id` = 4 limit 1
select * from `organization_members` where `user_id` = 4 and `designation` = 'secretary' limit 1
select * from `domain_of_works`
---
    public function show()
    {
        $user_id = Auth::id();

        $districts = District::get();
        $sub_districts = Upazila::get();
        $divisions = Division::get();
        $documents = OrganizationDocument::where('user_id', $user_id)->first();
        $banks = OrganizationBank::where('user_id', $user_id)->get();
        $organization_award = OrganizationAward::where('user_id', $user_id)->get();
        $organization_grant = OrganizationGrant::where('user_id', $user_id)->get();
        $org_address = OrganizationAddress::where('user_id', $user_id)->first();
        $org_details = Organization::where('user_id', $user_id)->first();
        $organization_activity = OrganizationActivity::where('user_id', $user_id)->first();
        $check_president_id = OrganizationMember::where('user_id', $user_id)->where('designation', 'president')->first();
        $check_secretary_id = OrganizationMember::where('user_id', $user_id)->where('designation', 'secretary')->first();

        $check_english_id = OrganizationMember::where('user_id', $user_id)->where('designation', '!=', 'secretary')->where('designation', '!=', 'president')->first();

        $domains = DomainOfWork::get();