app/Http/Controllers/AdminController.php

select * from `users` where `user_type` = 'developer' limit 1
select count(*) as aggregate from `users` where `user_type` = 'directorate'
select count(*) as aggregate from `divisions`
select count(*) as aggregate from `districts`
select count(*) as aggregate from `upazilas`
---
    public function admin_dashboard(Request $request)
    {
        $user = Auth::user();
        $admin_user = User::where('user_type', 'developer')->first();
        $admin_user->syncRoles(['System Engineer']);

        $admin_user = User::where('user_type', 'admin')->first();
        $admin_user->syncRoles(['Super Admin']);
        $d_director = User::where('user_type', 'directorate')->count();
        $organization = User::where('user_type', 'organization')->count();

        $divisions = Division::count();
        $districts = District::count();
        $upazila = Upazila::count();