app/Http/Controllers/AizUploadController.php

select * from `uploads` where `id` in ('28') and `uploads`.`deleted_at` is null
---
    public function get_preview_files(Request $request)
    {
        $ids = explode(',', $request->ids);
        $files = Upload::whereIn('id', $ids)->get();