app/Http/Controllers/HomeController.php

    public function registration(Request $request)
    {
        if (Auth::check()) {
            if(Auth::user()->user_type == 'admin' || Auth::user()->user_type == 'developer' || Auth::user()->user_type == 'directorate') {
                return redirect()->route('admin.dashboard');
            } else {
                return redirect()->route('organization.dashboard');
            }

        }

        $divisions = Division::where('country_id', '18')->orderBy('name', 'asc')->get();
---
select * from `divisions` where `country_id` = '18' order by `name` asc

    public function divisionWiseDistrict($id)
    {
        $districts = District::where('division_id', $id)->orderBy('name', 'asc')->get();
---
select * from `districts` where `division_id` = '1' order by `name` asc

    public function districtWiseUpazila($id)
    {
        $upazilas = Upazila::where('district_id', $id)->orderBy('name', 'asc')->get();
---
select * from `upazilas` where `district_id` = '2' order by `name` asc