app/Http/Controllers/OrganizationController.php

    public function index(Request $request)
    {
        $sort_search = null;

        $user = Auth::user();

        $organizations = Organization::query();

        if ($request->sort_search) {
            $sort_search = $request->sort_search;
            $organizations->where(function ($organization) use ($sort_search) {
                $organization->where('name', 'like', '%' . $sort_search . '%');
            });
        }

        if ($user->userrole && ($user->userrole->role_id == 4 || $user->userrole->role_id == 5 || $user->userrole->role_id == 6)) {
            if ($user->userrole->role_id == 5 || $user->userrole->role_id == 6) {
                $organizations->whereHas('address', function ($query) use ($user) {
                    if ($user->district) {
                        $query->where('district_id', $user->district);
                    }

                    if ($user->upazila) {
                        $query->where('upazila_id', $user->upazila);
                    }
                });
---
select * from `user_roles` where `user_roles`.`user_id` = 1 and `user_roles`.`user_id` is not null limit 1

    public function pending(Request $request)
    {
        $sort_search = null;

        $user = Auth::user();

        $organizations = Organization::where('status', 1);

        if ($request->sort_search) {
            $sort_search = $request->sort_search;
            $organizations->where(function ($organization) use ($sort_search) {
                $organization->where('name', 'like', '%' . $sort_search . '%');
            });
        }

        if ($user->userrole && ($user->userrole->role_id == 4 || $user->userrole->role_id == 5 || $user->userrole->role_id == 6)) {
            if ($user->userrole->role_id == 5 || $user->userrole->role_id == 6) {
                $organizations->whereHas('address', function ($query) use ($user) {
                    if ($user->district) {
                        $query->where('district_id', $user->district);
                    }

                    // Filter by upazila_id
                    if ($user->upazila) {
                        $query->where('upazila_id', $user->upazila);
                    }
                });
---
select * from `user_roles` where `user_roles`.`user_id` = 1 and `user_roles`.`user_id` is not null limit 1

    public function approved(Request $request)
    {
        $sort_search = null;
        $user = Auth::user();

        $organizations = Organization::where('status', 2);

        if ($request->sort_search) {
            $sort_search = $request->sort_search;
            $organizations->where(function ($organization) use ($sort_search) {
                $organization->where('name', 'like', '%' . $sort_search . '%');
            });
        }

        if ($user->userrole && ($user->userrole->role_id == 4 || $user->userrole->role_id == 5 || $user->userrole->role_id == 6)) {
            if ($user->userrole->role_id == 5 || $user->userrole->role_id == 6) {
                $organizations->whereHas('address', function ($query) use ($user) {
                    if ($user->district) {
                        $query->where('district_id', $user->district);
                    }

                    // Filter by upazila_id
                    if ($user->upazila) {
                        $query->where('upazila_id', $user->upazila);
                    }
                });
---
select * from `user_roles` where `user_roles`.`user_id` = 1 and `user_roles`.`user_id` is not null limit 1

    public function rejected(Request $request)
    {
        $sort_search = null;
        $user = Auth::user();

        $organizations = Organization::where('status', 3);

        if ($request->sort_search) {
            $sort_search = $request->sort_search;
            $organizations->where(function ($organization) use ($sort_search) {
                $organization->where('name', 'like', '%' . $sort_search . '%');
            });
        }

        if ($user->userrole && ($user->userrole->role_id == 4 || $user->userrole->role_id == 5 || $user->userrole->role_id == 6)) {
            if ($user->userrole->role_id == 5 || $user->userrole->role_id == 6) {
                $organizations->whereHas('address', function ($query) use ($user) {
                    if ($user->district) {
                        $query->where('district_id', $user->district);
                    }

                    // Filter by upazila_id
                    if ($user->upazila) {
                        $query->where('upazila_id', $user->upazila);
                    }
                });
---
select * from `user_roles` where `user_roles`.`user_id` = 1 and `user_roles`.`user_id` is not null limit 1