app/Http/Controllers/ProfileController.php

select * from `divisions`
select * from `districts` where `division_id` = '2'
select * from `upazilas` where `district_id` = '2'
---
    public function index()
    {
        $user = Auth::user();
        $divisions = Division::get();
        $districts = District::where('division_id',$user->division)->get();
        $upazilas = Upazila::where('district_id',$user->district)->get();

select * from `users` where `users`.`id` = '1' limit 1
---
    public function update(ProfileRequest $request, $id)
    {
        $user = User::findOrFail($id);