app/Http/Controllers/ReportController.php

    public function deputy_directors_list_report(Request $request)
    {
        $division_id = $request->input('division_id');
        $district_id = $request->input('district_id');
        $upazila_id = $request->input('upazila_id');

        $divisions = Division::all();

        $deputyDirectorsQuery = User::where('user_type', 'directorate')->where('is_approved', '1')->select();

        if (!empty($division_id)) {
            $deputyDirectorsQuery->where('division', $division_id);
        }
        if (!empty($district_id)) {
            $deputyDirectorsQuery->where('district', $district_id);
        }
        if (!empty($upazila_id)) {
            $deputyDirectorsQuery->where('upazila', $upazila_id);
        }
        $deputyDirectors = $deputyDirectorsQuery->get();
---
select * from `divisions`
select * from `users` where `user_type` = 'directorate' and `is_approved` = '1' and `division` = '1' and `district` = '23'

    public function organization_list_report(Request $request)
    {

        $division_id = $request->input('division_id');
        $district_id = $request->input('district_id');
        $upazila_id = $request->input('upazila_id');
        $domain_ids = $request->input('upazila_id[]');

        // dd($domain_id);

        $domains = DomainOfWork::get();

        $divisions = Division::all();
---
select * from `domain_of_works`
select * from `divisions`